[
  {
    "slug": "athletics",
    "name": "Athletics",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities:</p><ul><li>You attempt to climb a sheer or slippery cliff, avoid hazards while scaling a wall, or cling to a surface while something is trying to knock you off.</li><li>You try to jump an unusually long distance or pull off a stunt midjump.</li><li>You struggle to swim or stay afloat in treacherous currents, storm-tossed waves, or areas of thick seaweed. Or another creature tries to push or pull you underwater or otherwise interfere with your swimming.</li></ul>",
    "ability_score": {
      "slug": "strength",
      "name": "Strength"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "acrobatics",
    "name": "Acrobatics",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The GM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips.</p>",
    "ability_score": {
      "slug": "dexterity",
      "name": "Dexterity"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "sleight-of-hand",
    "name": "Sleight of Hand",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Whenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The GM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket.</p>",
    "ability_score": {
      "slug": "dexterity",
      "name": "Dexterity"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "stealth",
    "name": "Stealth",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Make a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard.</p>",
    "ability_score": {
      "slug": "dexterity",
      "name": "Dexterity"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "arcana",
    "name": "Arcana",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Intelligence (Arcana) check measures your ability to recall lore about spells, magic items, eldritch symbols, magical traditions, the planes of existence, and the inhabitants of those planes.</p>",
    "ability_score": {
      "slug": "intelligence",
      "name": "Intelligence"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "history",
    "name": "History",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Intelligence (History) check measures your ability to recall lore about historical events, legendary people, ancient kingdoms, past disputes, recent wars, and lost civilizations.</p>",
    "ability_score": {
      "slug": "intelligence",
      "name": "Intelligence"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "investigation",
    "name": "Investigation",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>When you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check.</p>",
    "ability_score": {
      "slug": "intelligence",
      "name": "Intelligence"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "nature",
    "name": "Nature",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles.</p>",
    "ability_score": {
      "slug": "intelligence",
      "name": "Intelligence"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "religion",
    "name": "Religion",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Intelligence (Religion) check measures your ability to recall lore about deities, rites and prayers, religious hierarchies, holy symbols, and the practices of secret cults.</p>",
    "ability_score": {
      "slug": "intelligence",
      "name": "Intelligence"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "animal-handling",
    "name": "Animal Handling",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>When there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal's intentions, the GM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver.</p>",
    "ability_score": {
      "slug": "wisdom",
      "name": "Wisdom"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "insight",
    "name": "Insight",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone's next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms.</p>",
    "ability_score": {
      "slug": "wisdom",
      "name": "Wisdom"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "medicine",
    "name": "Medicine",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>A Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness.</p>",
    "ability_score": {
      "slug": "wisdom",
      "name": "Wisdom"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "perception",
    "name": "Perception",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door.</p>",
    "ability_score": {
      "slug": "wisdom",
      "name": "Wisdom"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "survival",
    "name": "Survival",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>The GM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that owlbears live nearby, predict the weather, or avoid quicksand and other natural hazards.</p>",
    "ability_score": {
      "slug": "wisdom",
      "name": "Wisdom"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "deception",
    "name": "Deception",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast- talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie.</p>",
    "ability_score": {
      "slug": "charisma",
      "name": "Charisma"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "intimidation",
    "name": "Intimidation",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>When you attempt to influence someone through overt threats, hostile actions, and physical violence, the GM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision.</p>",
    "ability_score": {
      "slug": "charisma",
      "name": "Charisma"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "performance",
    "name": "Performance",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>Your Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment.</p>",
    "ability_score": {
      "slug": "charisma",
      "name": "Charisma"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  },
  {
    "slug": "persuasion",
    "name": "Persuasion",
    "type": {
      "slug": "skill",
      "name": "Skill"
    },
    "desc": "<p>When you attempt to influence someone or a group of people with tact, social graces, or good nature, the GM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk.</p>",
    "ability_score": {
      "slug": "charisma",
      "name": "Charisma"
    },
    "source": {
      "slug": "PHB",
      "name": "Player's Handbook"
    }
  }
]